recipes/oven-pancakes.org
#+TITLE: Oven Pancakes
#+DATE: 2020-06-14
#+SETUPFILE: recipe.setup

[[https://tasty.co/recipe/kid-friendly-vegan-pancakes][Original link]]

* Ingredients
** Pancake
  - 2 cups flour (250 g)
  - 2 tablespoons sugar
  - 2 tablespoons baking powder
  - 1/2 teaspoon salt
  - 2 cups almond milk (480 mL)
  - 2 tablespoons apple cider vinegar
  - 2 teaspoons vanilla

** Optional toppings
   - Strawberries
   - Blueberries
   - Banana
   - Dark choc chips

* Method
  1. Preheat oven to 200\deg{}C
  2. In a medium bowl, add the flour, sugar, baking powder, and salt, and stir to combine.
  3. In a medium bowl or liquid measuring cup, add almond milk, apple cider vinegar, and vanilla, and stir to combine. Let it sit for 5-7 minutes.
  4. Pour the liquid mixture into the dry mixture and whisk until smooth.
  5. Let batter rest for 5 minutes.
  6. Pour the batter onto a baking sheet covered with parchment paper, smooth batter out so it is even on all sides.
  7. Add toppings of your choice
  8. Bake for 15 minutes

* Nutrition
| Nutrition info  |        |
|-----------------+--------|
| Servings: 6.0   |        |
| Per serve:      |        |
|-----------------+--------|
| *Energy*          | 856 kJ |
| *Total fat*       | 1 g    |
| Saturated       | 0 g    |
| Monounsaturated | 1 g    |
| Polyunsaturated | 0 g    |
| Trans           | 0 g    |
| *Sodium*          | 732 mg |
| *Total carbs*     | 38 g   |
| Dietary fibre   | 1 g    |
| Sugars          | 9 g    |
| *Protein*         | 5 g    |
