recipes/oven-pancakes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Oven Pancakes</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="james" />
<link rel="stylesheet" type="text/css" href="../static/recipe.css" />
<link rel="icon" type="image/ico" href="../static/favicon.svg" />
</head>
<body>
<div id="org-div-home-and-up"> <a href="../index.html"> Home </a> </div> <div id="btns"><button id="copy-btn" onclick="copyTicked()"></button> <button id="untick-btn" onclick="untickAll()"></button></div><div id="notify">Copied!</div><div id="content">
<h1 class="title">Oven Pancakes</h1>
<p>
<a href="https://tasty.co/recipe/kid-friendly-vegan-pancakes">Original link</a>
</p>

<div id="outline-container-org1ef3dc0" class="outline-2">
<h2 id="org1ef3dc0">Ingredients</h2>
<div class="outline-text-2" id="text-org1ef3dc0">
</div>
<div id="outline-container-org5d85675" class="outline-3">
<h3 id="org5d85675">Pancake</h3>
<div class="outline-text-3" id="text-org5d85675">
<ul class="org-ul">
<li>2 cups flour (250 g)</li>
<li>2 tablespoons sugar</li>
<li>2 tablespoons baking powder</li>
<li>1/2 teaspoon salt</li>
<li>2 cups almond milk (480 mL)</li>
<li>2 tablespoons apple cider vinegar</li>
<li>2 teaspoons vanilla</li>
</ul>
</div>
</div>

<div id="outline-container-orga6aaf3d" class="outline-3">
<h3 id="orga6aaf3d">Optional toppings</h3>
<div class="outline-text-3" id="text-orga6aaf3d">
<ul class="org-ul">
<li>Strawberries</li>
<li>Blueberries</li>
<li>Banana</li>
<li>Dark choc chips</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgb4bbf2c" class="outline-2">
<h2 id="orgb4bbf2c">Method</h2>
<div class="outline-text-2" id="text-orgb4bbf2c">
<ol class="org-ol">
<li>Preheat oven to 200&deg;C</li>
<li>In a medium bowl, add the flour, sugar, baking powder, and salt, and stir to combine.</li>
<li>In a medium bowl or liquid measuring cup, add almond milk, apple cider vinegar, and vanilla, and stir to combine. Let it sit for 5-7 minutes.</li>
<li>Pour the liquid mixture into the dry mixture and whisk until smooth.</li>
<li>Let batter rest for 5 minutes.</li>
<li>Pour the batter onto a baking sheet covered with parchment paper, smooth batter out so it is even on all sides.</li>
<li>Add toppings of your choice</li>
<li>Bake for 15 minutes</li>
</ol>
</div>
</div>

<div id="outline-container-orgca6930a" class="outline-2">
<h2 id="orgca6930a">Nutrition</h2>
<div class="outline-text-2" id="text-orgca6930a">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Nutrition info</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Servings: 6.0</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Per serve:</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><b>Energy</b></td>
<td class="org-left">856 kJ</td>
</tr>

<tr>
<td class="org-left"><b>Total fat</b></td>
<td class="org-left">1 g</td>
</tr>

<tr>
<td class="org-left">Saturated</td>
<td class="org-left">0 g</td>
</tr>

<tr>
<td class="org-left">Monounsaturated</td>
<td class="org-left">1 g</td>
</tr>

<tr>
<td class="org-left">Polyunsaturated</td>
<td class="org-left">0 g</td>
</tr>

<tr>
<td class="org-left">Trans</td>
<td class="org-left">0 g</td>
</tr>

<tr>
<td class="org-left"><b>Sodium</b></td>
<td class="org-left">732 mg</td>
</tr>

<tr>
<td class="org-left"><b>Total carbs</b></td>
<td class="org-left">38 g</td>
</tr>

<tr>
<td class="org-left">Dietary fibre</td>
<td class="org-left">1 g</td>
</tr>

<tr>
<td class="org-left">Sugars</td>
<td class="org-left">9 g</td>
</tr>

<tr>
<td class="org-left"><b>Protein</b></td>
<td class="org-left">5 g</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</body>
</html>
